[
    {
      "img": "https://scontent.fmkz1-1.fna.fbcdn.net/v/t1.0-9/88148814_116386133288082_996318166541926400_o.jpg?_nc_cat=101&ccb=2&_nc_sid=730e14&_nc_ohc=kdnWyYQypLkAX_cLdh6&_nc_ht=scontent.fmkz1-1.fna&oh=a8cfe9219ffc546738c955b361702fb0&oe=5FBBE369",
      "title": "6 Things I learned from joining the IET",
      "slug": "6-things-i-learned-from-joining-the-IET",
      "author": "Hovah Yii",
      "summary": "Looking back at my life, I wonder what could be the difference if I do not join the IET...",
      "paragraphOne": "I joined the IET for more than 3 years now. It all started during my Foundation studies at Swinburne. I was looking for a professional body or club to join to make my university life fun and enjoyable. It was during the Recruitment Drive day, I came across the IET booth. The senior approached me and told me about the IET. I was impressed by his presentation and I signed up after that. The main reason I signing up is because I learnt that the IET is a professional body and I get to meet people from all around the world and from other campus.",
      "paragraphTwo": "Through the IET, I was able to visit many factories and industries. Seeing new technology evolving and get a chance to experience them opened up my eyes. After joining the IET for a year, I volunteered myself to become one of the exco for the IET. And it was during that period, I grew and learned a lot. To summarise, there are 6 things I learned from joining the IET.",
      "pointOne": "Leadership",
      "pointOneEla": "By organising and conducting events through the IET, I learnt how to lead and coordinate others to work together moving towards the same goal. When I was assigned to be the main organiser, I would need to organise meeting and present my idea in front of the others. I will also need to learn how to communicate nicely and understand the strength of each committee to assign them with suitable job or works.",
      "pointTwo": "Soft skill matters",
      "pointTwoEla": "Before I joined the IET, CGPA and results are all that matter to me. It was when I joined the IET I came to the realization that soft skill is more important than getting good result. Because when we go out to work, we are not working as an individual but as a community. Hence, it is important to learn how to communicate and speak with others to get our ideas out and reach the others. ",
      "pointThree": "Hands on is more important than theory",
      "pointThreeEla": "Theory that we learnt are designed to answer the exam questions. However, in real life, it is more important for us to know how to apply the theory we learnt. Like the saying goes, 'Knowing is not enough, we must apply'. ",
      "pointFour": "Teamwork get us further",
      "pointFourEla": "I remembered my first task as the event organiser for the IET, it was a site visit. I do not have any prior experience nor do I organise a site visit before. Luckily, I have a good team and helpful committees. Whenever I faced a problem, whether it is communication or transportation problem, I will meet with all my committee members and ask them to help me sort them out. It is important to know how to work with others because individual knowledge and strength is limited.",
      "pointFive": "Industrial Revolution 4.0",
      "pointFiveEla": "Joining the IET allows me to come accross the term IR 4.0. To be honest, I never heard the term before. I heard this term multiple times during seminar or webinar. That's when I realised Artificial Intelligence, IoT are part of the IR 4.0. Our nation is also moving toward IR 4.0. ",
      "pointSix": "Life long learning",
      "pointSixEla": "We are living in the age of information overload. The knowledge we learnt is volatile. What works 20 years ago might not workable in this era. Hence, we need to keep on updating ourselves with new knowledge and technology so that we will not be left behind.",
      "postedOn": "27 October 2020",
      "time": "9:00 PM"
    }
  ]
  